<h1> Chapter 03 - Data Wrangling </h1>

Imports

In [17]:
import pandas as pd
import numpy  as np
import collections

## 3.0 Introduction

In [2]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'
dataframe = pd.read_csv(url)
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

## 3.1 Creating a Data Frame

In [6]:
dataframe = pd.DataFrame()

dataframe['Name'] = ['Jacky Jackson', 'Steven Stevenson' ]
dataframe['Age'] = [38, 25]
dataframe['Driver'] = [True, False]

dataframe

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [8]:
new_person = pd.Series(['Molly Mooney', 49, True], index=['Name', 'Age', 'Driver'])
dataframe.append(new_person, ignore_index=True )

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False
2      Molly Mooney   49    True

In [9]:
new_person

Name      Molly Mooney
Age                 49
Driver            True
dtype: object

## 3.2 Describing the Data

In [10]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'
dataframe = pd.read_csv(url)
dataframe.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [11]:
dataframe.shape

(1313, 6)

In [12]:
dataframe.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

## 3.3 Navigating DataFrames

In [13]:
dataframe.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [14]:
dataframe.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [15]:
dataframe[:4]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [16]:
# we can set a string to index
dataframe = dataframe.set_index(dataframe['Name'])
dataframe.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

## 3.4 Selecting Rows Based on Conditionals

In [17]:
dataframe[dataframe['Sex'] == 'female'].head()

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
"Andrews, Miss Kornelia Theodosia","Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
"Appleton, Mrs Edward Dale (Charlotte Lamson)","Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1

In [19]:
dataframe[(dataframe['Sex'] == 'female') & (dataframe['Age'] >= 65)]

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Crosby, Mrs Edward Gifford (Catherine Elizabeth Halstead)","Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

## 3.5 Replacing Values

In [20]:
dataframe['Sex'].replace('female', 'Woman').head(2)

Name
Allen, Miss Elisabeth Walton    Woman
Allison, Miss Helen Loraine     Woman
Name: Sex, dtype: object

In [21]:
dataframe['Sex'].replace(['female', 'male'],['woman', 'man']).head()

Name
Allen, Miss Elisabeth Walton                     woman
Allison, Miss Helen Loraine                      woman
Allison, Mr Hudson Joshua Creighton                man
Allison, Mrs Hudson JC (Bessie Waldo Daniels)    woman
Allison, Master Hudson Trevor                      man
Name: Sex, dtype: object

In [22]:
dataframe.replace(1, 'One').head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,One,One
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,One

In [23]:
# also accepts regular expressions
dataframe.replace(r"1st", "First", regex = True).head(2)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",First,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",First,2.0,female,0,1

## 3.6 Renaming Columns

In [26]:
dataframe.rename(columns = {'PClass': 'Passenger Class'}).head(2)

,Name,Passenger Class,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [27]:
dataframe.rename(columns = {'PClass': 'Passenger Class', 'Sex':'Gender'}).head(2)

,Name,Passenger Class,Age,Gender,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [30]:
columns_names = collections.defaultdict(str)

for name in dataframe.columns:
    columns_names[name]
    
columns_names

defaultdict(str,
            {'Name': '',
             'PClass': '',
             'Age': '',
             'Sex': '',
             'Survived': '',
             'SexCode': ''})

## 3.7 Finding the Minimum, Maximum, Sum, Average, and Count

In [4]:
print('Maximum:', dataframe['Age'].max())
print('Minimum:', dataframe['Age'].min())
print('Mean:', dataframe['Age'].mean())
print('Sum:', dataframe['Age'].sum())
print('Count:', dataframe['Age'].count())

Maximum: 71.0
Minimum: 0.17
Mean: 30.397989417989418
Sum: 22980.88
Count: 756

In [7]:
dataframe.count()

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

In [10]:
print('Var:', dataframe['Age'].var())
print('Standard Deviation:', dataframe['Age'].std())
print('Kurtosis:', dataframe['Age'].kurt())
print('Skewness:', dataframe['Age'].skew())
print('Sem:', dataframe['Age'].sem())
print('Median:', dataframe['Age'].median())
print('Mode:', dataframe['Age'].mode())

Var: 203.32047012439116
Standard Deviation: 14.259048710359018
Kurtosis: -0.036536168924722556
Skewness: 0.36851087371648295
Sem: 0.5185965877244655
Median: 28.0
Mode: 0    22.0
dtype: float64

## 3.8 Finding Unique Values

In [12]:
dataframe['Sex'].unique()

array(['female', 'male'], dtype=object)

In [13]:
dataframe['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [14]:
dataframe['PClass'].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

In [15]:
dataframe['PClass'].nunique()

4

## 3.9  Handling Missing Values

In [16]:
dataframe[dataframe['Age'].isnull()].head()

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0
14            Baumann, Mr John D    1st  NaN    male         0        0
29       Borebank, Mr John James    1st  NaN    male         0        0
32            Bradley, Mr George    1st  NaN    male         1        0

In [19]:
dataframe['Sex'] = dataframe.Sex.replace('male', np.nan)

In [20]:
dataframe[dataframe['Age'].isnull()].head()

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN     NaN         1        0
14            Baumann, Mr John D    1st  NaN     NaN         0        0
29       Borebank, Mr John James    1st  NaN     NaN         0        0
32            Bradley, Mr George    1st  NaN     NaN         1        0

## 3.10 Deleting a Column

In [21]:
dataframe.drop('Age', axis = 1).head(2)

                           Name PClass     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  female         1        1
1   Allison, Miss Helen Loraine    1st  female         0        1

In [23]:
dataframe.drop(['Age', 'Sex'], axis = 1).head(2)

                           Name PClass  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st         1        1
1   Allison, Miss Helen Loraine    1st         0        1

In [24]:
dataframe.drop(dataframe.columns[1], axis = 1).head()

,Name,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",29.00,female,1,1
1,"Allison, Miss Helen Loraine",2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",30.00,NaN,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",25.00,female,0,1
4,"Allison, Master Hudson Trevor",0.92,NaN,1,0

## 3.11 Deleting a Row

In [27]:
dataframe[dataframe['Sex'] != 'male'].head(10)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,NaN,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,NaN,1,0
5,"Anderson, Mr Harry",1st,47.00,NaN,1,0
6,"Andrews, Miss Kornelia Theodosia",1st,63.00,female,1,1
7,"Andrews, Mr Thomas, jr",1st,39.00,NaN,0,0
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.00,female,1,1
9,"Artagaveytia, Mr Ramon",1st,71.00,NaN,0,0

In [31]:
dataframe[dataframe.Name != 'Allison, Miss Helen Loraine'].head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0     NaN         0        0

## 3.12 Dropping Duplicate Rows

In [32]:
dataframe.drop_duplicates().head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [34]:
print('Numer of rows in the original dataframe:', len(dataframe))
print('Numer of rows after deduping:', len(dataframe.drop_duplicates()))

Numer of rows in the original dataframe: 1313
Numer of rows after deduping: 1313

In [37]:
dataframe.drop_duplicates(subset=['Sex'])

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0     NaN         0        0

In [38]:
dataframe.drop_duplicates(subset=['Sex'], keep='last')

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0     NaN         0        0

## 3.12 Grouping Rows by Values

In [40]:
dataframe = pd.read_csv(url) # reimporting the titanic dataset
dataframe.groupby('Sex').mean()

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [41]:
dataframe.groupby('Sex')

In [43]:
dataframe.groupby('Survived')['Name'].count()

Survived
0    863
1    450
Name: Name, dtype: int64

In [44]:
dataframe.groupby(['Sex', 'Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

## 3.14 Grouping Rows by Time

In [45]:
time_index = pd.date_range('06/06/2017', periods=100000, freq = '30S')

In [46]:
dataframe = pd.DataFrame(index=time_index)

In [47]:
dataframe['Sale_Amount'] = np.random.randint(1,10,100000)

In [48]:
dataframe

                     Sale_Amount
2017-06-06 00:00:00            7
2017-06-06 00:00:30            7
2017-06-06 00:01:00            6
2017-06-06 00:01:30            7
2017-06-06 00:02:00            7
...                          ...
2017-07-10 17:17:30            7
2017-07-10 17:18:00            6
2017-07-10 17:18:30            5
2017-07-10 17:19:00            4
2017-07-10 17:19:30            3

[100000 rows x 1 columns]

In [49]:
dataframe.resample('W').sum()

            Sale_Amount
2017-06-11        86422
2017-06-18       100775
2017-06-25       101044
2017-07-02       100486
2017-07-09       101250
2017-07-16        10483

In [50]:
dataframe.resample('W').mean()

            Sale_Amount
2017-06-11     5.001273
2017-06-18     4.998760
2017-06-25     5.012103
2017-07-02     4.984425
2017-07-09     5.022321
2017-07-16     5.039904

In [53]:
dataframe.resample('2W').sum()

            Sale_Amount
2017-06-11        86422
2017-06-25       201819
2017-07-09       201736
2017-07-23        10483

## 3.15 Looping Over a Column

In [55]:
dataframe = pd.read_csv(url) # reimporting titanic dataset
for name in dataframe['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

## 3.16 Applying a Function Over All Elements in a Column

In [56]:
def uppercase(x):
    return x.upper()

dataframe['Name'].apply(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

## 3.17 Applying a Function to Groups

In [57]:
dataframe.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

## 3.18 Concatenating DataFrames

In [58]:
data_a = {'id': ['1','2','3'],
          'first': ['Alex', 'Amy','Allen'],
          'last': ['Anderson', 'Ackerman', 'Ali']}

dataframe_a = pd.DataFrame(data_a, columns = ['id', 'first', 'last'])

In [59]:
data_b = {'id': ['4','5','6'],
          'first': ['Billy', 'Brian','Bran'],
          'last': ['Bonder', 'Black', 'Balwner']}

dataframe_b = pd.DataFrame(data_b, columns = ['id', 'first', 'last'])

In [60]:
pd.concat([dataframe_a, dataframe_b], axis = 0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

In [61]:
pd.concat([dataframe_a, dataframe_b], axis = 1)

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

In [62]:
row = pd.Series([10, 'Chris', 'Chillon'], index = ['id', 'first', 'last'])
dataframe_a.append(row, ignore_index=True)

   id  first      last
0   1   Alex  Anderson
1   2    Amy  Ackerman
2   3  Allen       Ali
3  10  Chris   Chillon

## 3.19 Merging DataFrames

In [63]:
employee_data = {
    'employee_id': ['1', '2', '3', '4'],
    'name': ['Amy Jones', 'Allen Keys', 'Alice Bees', 'Tim Horton']
}

dataframe_employees = pd.DataFrame(employee_data, columns = ['employee_id', 'name'])

In [66]:
sales_data = {
    'employee_id': ['3', '4', '5', '6'],
    'total_sales': ['23456', '2512', '2345', '1455']
             }
dataframe_sales = pd.DataFrame(sales_data, columns = ['employee_id', 'total_sales'])

In [67]:
pd.merge(dataframe_employees, dataframe_sales, on = 'employee_id')

  employee_id        name total_sales
0           3  Alice Bees       23456
1           4  Tim Horton        2512

In [68]:
pd.merge(dataframe_employees, dataframe_sales, on = 'employee_id', how = 'outer')

  employee_id        name total_sales
0           1   Amy Jones         NaN
1           2  Allen Keys         NaN
2           3  Alice Bees       23456
3           4  Tim Horton        2512
4           5         NaN        2345
5           6         NaN        1455

In [71]:
pd.merge(dataframe_employees, dataframe_sales, on = 'employee_id', how = 'left')

  employee_id        name total_sales
0           1   Amy Jones         NaN
1           2  Allen Keys         NaN
2           3  Alice Bees       23456
3           4  Tim Horton        2512

In [72]:
pd.merge(dataframe_employees, dataframe_sales, left_on = 'employee_id', right_on = 'employee_id')

  employee_id        name total_sales
0           3  Alice Bees       23456
1           4  Tim Horton        2512